# Taps
tap 'homebrew/bundle'
tap "jandedobbeleer/oh-my-posh"
tap "snyk/tap"

# Binaries
brew '1password-cli'
brew 'codex'
brew 'ffmpeg'
brew 'fnm'
brew 'gh'
brew 'git'
brew 'go'
brew 'helm'
brew 'hugo'
brew 'imagemagick'
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew 'kubernetes-cli'
brew 'kubectx'
brew 'mackup'
brew 'mailsy'
brew 'mas'
brew 'pnpm'
brew 'protobuf'
brew 'pyenv'
brew 'snyk'
brew 'speedtest-cli'
brew 'sqlite3'
brew 'sqlite-utils'
brew 'tilt'
brew 'woff2'
brew 'yt-dlp'
brew 'zsh-autosuggestions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Apps
cask '1password'
cask 'arc'
cask 'arq'
cask 'balenaetcher'
cask 'bruno'
cask 'calibre'
cask 'claude'
cask 'claude-code'
cask 'cryptomator'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'gpg-suite-no-mail'
cask 'goland'
cask 'google-chrome'
cask 'imageoptim'
cask 'iterm2'
cask 'jordanbaird-ice'
cask 'keka'
cask 'kindle'
cask 'keybase'
cask 'legcord'
cask 'macfuse'
cask 'obsidian'
cask 'pdf-expert'
cask 'raycast'
cask 'rectangle'
cask 'rocket'
cask 'signal'
cask 'slack'
cask 'spotify'
cask 'varacrypt'
cask 'vlc'
cask 'nordvpn'
cask 'utm'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zen'

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Calcbot', id: 931657367
mas 'Paprika Recipe Manager 3', id: 1303222628
mas 'Bear', id: 1091189122
mas 'Skitch', id: 425955336
